Revit 2024 API
FluidType.GetFluidTemperatureSetIterator Method
Returns a FluidTemperatureSetIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FluidTemperatureSetIterator GetFluidTemperatureSetIterator()
Visual Basic
Public Function GetFluidTemperatureSetIterator As FluidTemperatureSetIterator
Visual C++
public:
FluidTemperatureSetIterator^ GetFluidTemperatureSetIterator()
Return Value
A FluidTemperatureSetIterator object that can be used to iterate through key-value pairs in the collection.
See Also
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace